Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: XML based format used by Apple which is able to store plural forms of a string.
sv: XML-baserat format som anvÃ¤nds av Apple och som kan lagra pluralformer av en strÃ¤ng.

source: `Stringsdict File Format <https://developer.apple.com/documentation/xcode/localizing-strings-that-contain-plurals>`_
sv: `Stringsdict-filformat <https://developer.apple.com/documentation/xcode/localizing-strings-that-contain-plurals>`_

source: ``Resources/en.lproj/Localizable.stringsdict`` or ``Resources/Base.lproj/Localizable.stringsdict``
sv: ``Resources/en.lproj/Localizable.stringsdict`` eller ``Resources/Base.lproj/Localizable.stringsdict``

source: `Stringsdict file`
sv: `Stringsdict-fil`

source: Subtitle files
sv: Subtitle-filer

source: Weblate can translate various subtitle files:
sv: Weblate kan Ã¶versÃ¤tta olika undertextsfiler:

source: SubRip subtitle file (``*.srt``)
sv: SubRip-undertextfil (``*.srt``)

source: MicroDVD subtitle file (``*.sub``)
sv: MicroDVD-undertextfil (``*.sub``)

source: Advanced Substation Alpha subtitles file (``*.ass``)
sv: Avancerad understation Alpha-undertextfil (``*.ass``)

source: Substation Alpha subtitle file (``*.ssa``)
sv: Substation Alpha undertextfil (``*.ssa``)

source: `SubRip subtitle file`
sv: `SubRip-undertextfil`

source: Source string explanation is saved and loaded from the ``<descrip>`` tag, translation string explanation from ``<note from="translator">``.
sv: KÃ¤llstrÃ¤ngens fÃ¶rklaring sparas och laddas frÃ¥n taggen ``<descrip>``, Ã¶versÃ¤ttningsstrÃ¤ngens fÃ¶rklaring frÃ¥n ``<note from="translator">``.

source: Administrative status
sv: Administrativ status

source: Terms with administrative status ``forbidden`` or ``obsolete`` in ``<termNote type="administrativeStatus">`` are marked with the ``forbidden`` flag (:ref:`glossary-forbidden`).
sv: Termer med administrativ status ``fÃ¶rbjuden`` eller ``fÃ¶rÃ¥ldrad`` i ``<termNote type="administrativeStatus">`` Ã¤r markerade med flaggan ``fÃ¶rbjuden`` (:ref:`glossary-forbidden`).

source: Translation needed
sv: ÃversÃ¤ttning behÃ¶vs

source: Terms with ``<termNote type="translationNote">`` containing ``no`` are marked as read-only (:ref:`glossary-untranslatable`).
sv: Termer med ``<termNote type="translationNote">`` som innehÃ¥ller ``no`` markeras som skrivskyddade (:ref:`glossary-untranslatable`).

source: Usage notes
sv: AnvÃ¤ndningsanvisningar

source: Usage notes from ``<descrip type="Usage note">`` tags are displayed in the glossary.
sv: AnvÃ¤ndningsanvisningar frÃ¥n taggarna ``<descrip type="Usage note">`` visas i ordlistan.

source: TBX is an XML format for the exchange of terminology data.
sv: TBX Ã¤r ett XML-format fÃ¶r utbyte av terminologidata.

source: `TBX on Wikipedia <https://en.wikipedia.org/wiki/TermBase_eXchange>`_
sv: `TBX pÃ¥ Wikipedia <https://en.wikipedia.org/wiki/TermBase_eXchange>`_

source: Explanations
sv: FÃ¶rklaringar

source: Weblate loads and saves explanation from TBX files to be displayed in :ref:`glossary`.
sv: Weblate laddar och sparar fÃ¶rklaringar frÃ¥n TBX-filer som ska visas i :ref:`glossary`.

source: Translation explanation is stored as ``<note from="translator"></note>`` tag.
sv: ÃversÃ¤ttningsfÃ¶rklaringen lagras som taggen ``<note from="translator"></note>``.

source: Source string explanation is stored as ``<descrip></descrip>`` tag.
sv: KÃ¤llstrÃ¤ngens fÃ¶rklaring lagras som taggen ``<descrip></descrip>``.

source: `TermBase eXchange file`
sv: TermBase eXchange-fil

source: TOML is a generic format like :doc:`/formats/yaml` or :doc:`/formats/json` and can be used to localize applications.
sv: TOML Ã¤r ett generiskt format som :doc:`/formats/yaml` eller :doc:`/formats/json` och kan anvÃ¤ndas fÃ¶r att lokalisera applikationer.

source: Weblate supports TOML in several variants:
sv: Weblate stÃ¶der TOML i flera varianter:

source: `TOML file`
sv: `TOML-fil`

source: Plain TOML file without support for plurals.
sv: Vanlig TOML-fil utan stÃ¶d fÃ¶r pluralformer.

source: `go-i18n TOML file`
sv: `go-i18n TOML-fil`

source: go-i18n variant with plurals support.
sv: go-i18n-variant med stÃ¶d fÃ¶r pluralformer.

source: Text files
sv: Text-filer

source: The translatable content is extracted from the plain text files and offered for the translation. Each paragraph is translated as a separate string.
sv: Det Ã¶versÃ¤ttningsbara innehÃ¥llet extraheras frÃ¥n vanliga textfiler och erbjuds fÃ¶r Ã¶versÃ¤ttning. Varje stycke Ã¶versÃ¤tts som en separat strÃ¤ng.

source: There are several flavors of this format:
sv: Det finns flera varianter av detta format:

source: `Plain text file`
sv: `Vanlig textfil`

source: File format used when translating extensions for Mozilla Firefox or Google Chromium.
sv: Filformat som anvÃ¤nds vid Ã¶versÃ¤ttning av tillÃ¤gg fÃ¶r Mozilla Firefox eller Google Chromium.

source: While this format is called JSON, its specification allows including "//"-style comments. Weblate does strip these comments while parsing the files and discards them when saving.
sv: Ãven om detta format kallas JSON, tillÃ¥ter dess specifikation att kommentarer i stil med "//" inkluderas. Weblate tar bort dessa kommentarer nÃ¤r filerna analyseras och kasserar dem nÃ¤r de sparas.

source: `WebExtension JSON file`
sv: `WebExtension JSON-fil`

source: Windows RC files
sv: Windows RC-filer

source: Support for Windows RC files has been rewritten.
sv: StÃ¶det fÃ¶r Windows RC-filer har skrivits om.

source: RC files are language files used to localize translatable text, dialogs, menus, for Windows applications.
sv: RC-filer Ã¤r sprÃ¥kfiler som anvÃ¤nds fÃ¶r att lokalisera Ã¶versÃ¤ttningsbar text, dialogrutor och menyer fÃ¶r Windows-applikationer.

source: Example Windows RC file:
sv: Exempel pÃ¥ Windows RC-fil:

source: `RC file`
sv: `RC-fil`

source: XLIFF 1.1 and 1.2
sv: XLIFF 1.1 och 1.2

source: :doc:`/formats/xliff2` is a different format and is not backwards compatible with XLIFF 1.2.
sv: :doc:`/formats/xliff2` Ã¤r ett annat format och Ã¤r inte bakÃ¥tkompatibelt med XLIFF 1.2.

source: XML-based format created to standardize translation files, but in the end it is one of `many standards <https://xkcd.com/927/>`_, in this area.
sv: XML-baserat format som skapats fÃ¶r att standardisera Ã¶versÃ¤ttningsfiler, men i slutÃ¤ndan Ã¤r det en av `mÃ¥nga standarder <https://xkcd.com/927/>`_ inom detta omrÃ¥de.

source: `XML Localization Interchange File Format (XLIFF)` is usually used as bilingual, but Weblate supports it as monolingual as well.
sv: XML Localization Interchange File Format (XLIFF) anvÃ¤nds vanligtvis som tvÃ¥sprÃ¥kigt, men Weblate stÃ¶der det Ã¤ven som ensprÃ¥kigt.

source: Weblate supports XLIFF in several variants:
sv: Weblate stÃ¶der XLIFF i flera varianter:

source: `XLIFF 1.2 translation file`
sv: `XLIFF 1.2 Ã¶versÃ¤ttningsfil`

source: Simple XLIFF file where content of the elements is stored as plain text (all XML elements being escaped).
sv: Enkel XLIFF-fil dÃ¤r innehÃ¥llet i elementen lagras som ren text (alla XML-element Ã¤r undantagna).

source: `XLIFF 1.2 with placeables support`
sv: XLIFF 1.2 med stÃ¶d fÃ¶r placerbara element

source: Standard XLIFF supporting placeables and other XML elements.
sv: Standard XLIFF som stÃ¶der placerbara element och andra XML-element.

source: `XLIFF 1.2 with gettext extensions`
sv: `XLIFF 1.2 med gettext-tillÃ¤gg`

source: XLIFF enriched by `XLIFF 1.2 Representation Guide for Gettext PO`_ to support plurals.
sv: XLIFF berikad med `XLIFF 1.2 Representation Guide for Gettext PO`_ fÃ¶r att stÃ¶dja pluralformer.

source: `XML Localization Interchange File Format (XLIFF)`_ specification
sv: `XML Localization Interchange File Format (XLIFF)`_ specifikation

source: `XLIFF 1.2 Representation Guide for Gettext PO`_
sv: `XLIFF 1.2 Representationsguide fÃ¶r Gettext PO`_

source: `XLIFF on Wikipedia <https://en.wikipedia.org/wiki/XLIFF>`_
sv: `XLIFF pÃ¥ Wikipedia <https://en.wikipedia.org/wiki/XLIFF>`_

source: Translation states
sv: ÃversÃ¤ttningsstatus

source: The ``state`` attribute in the file is partially processed and mapped to the "Needs edit" state in Weblate (the following states are used to flag the string as needing edit if there is a target present: ``new``, ``needs-translation``, ``needs-adaptation``, ``needs-l10n``). Should the ``state`` attribute be missing, a string is considered translated as soon as a ``<target>`` element exists.
sv: Attributet ``state`` i filen bearbetas delvis och mappas till statusen "BehÃ¶ver redigeras" i Weblate (fÃ¶ljande statusar anvÃ¤nds fÃ¶r att markera strÃ¤ngen som behÃ¶ver redigeras om det finns ett mÃ¥l: ``new``, ``needs-translation``, ``needs-adaptation``, ``needs-l10n``). Om attributet ``state`` saknas betraktas en strÃ¤ng som Ã¶versatt sÃ¥ snart ett ``<target>``-element finns.

source: If the translation string has ``approved="yes"``, it will also be imported into Weblate as "Approved", anything else will be imported as "Waiting for review" (which matches the XLIFF specification).
sv: Om Ã¶versÃ¤ttningsstrÃ¤ngen har ``approved="yes"``, kommer den ocksÃ¥ att importeras till Weblate som "GodkÃ¤nd", allt annat kommer att importeras som "VÃ¤ntar pÃ¥ granskning" (vilket Ã¶verensstÃ¤mmer med XLIFF-specifikationen).

source: While saving, Weblate doesn't add those attributes unless necessary:
sv: NÃ¤r du sparar lÃ¤gger Weblate inte till dessa attribut om det inte Ã¤r nÃ¶dvÃ¤ndigt:

source: The ``state`` attribute is only added in case string is marked as needing edit.
sv: Attributet ``state`` lÃ¤ggs endast till om strÃ¤ngen Ã¤r markerad som behÃ¶ver redigering.

source: The ``approved`` attribute is only added in case string has been reviewed.
sv: Attributet ``godkÃ¤nt`` lÃ¤ggs endast till om strÃ¤ngen har granskats.

source: In other cases the attributes are not added, but they are updated in case they are present.
sv: I andra fall lÃ¤ggs attributen inte till, men de uppdateras om de finns.

source: That means that when using the XLIFF format, it is strongly recommended to turn on the Weblate review process, in order to see and change the approved state of strings.
sv: Det innebÃ¤r att nÃ¤r du anvÃ¤nder XLIFF-formatet rekommenderas det starkt att aktivera Weblate-granskningsprocessen fÃ¶r att kunna se och Ã¤ndra strÃ¤ngarnas godkÃ¤nda status.

source: Similarly upon importing such files (in the upload form), you should choose :guilabel:`Import as translated` under :guilabel:`Processing of strings needing edit`.
sv: PÃ¥ samma sÃ¤tt bÃ¶r du vid import av sÃ¥dana filer (i uppladdningsformulÃ¤ret) vÃ¤lja :guilabel:`Importera som Ã¶versatt` under :guilabel:`Bearbetning av strÃ¤ngar som behÃ¶ver redigeras`.

source: Whitespace and newlines in XLIFF
sv: Mellanslag och radbrytningar i XLIFF

source: Generally types or amounts of whitespace is not differentiated between in XML formats. If you want to keep it, you have to add the ``xml:space="preserve"`` flag to the string.
sv: I allmÃ¤nhet skiljer man inte mellan olika typer eller mÃ¤ngder av blanksteg i XML-format. Om du vill behÃ¥lla dem mÃ¥ste du lÃ¤gga till flaggan ``xml:space="preserve"`` till strÃ¤ngen.

source: Specifying translation flags
sv: Ange Ã¶versÃ¤ttningsflaggor

source: You can specify additional translation flags (see :ref:`custom-checks`) by using the ``weblate-flags`` attribute. Weblate also understands ``maxwidth`` and ``font`` attributes from the XLIFF specification:
sv: Du kan ange ytterligare Ã¶versÃ¤ttningsflaggor (se :ref:`custom-checks`) genom att anvÃ¤nda attributet ``weblate-flags``. Weblate fÃ¶rstÃ¥r ocksÃ¥ attributen ``maxwidth`` och ``font`` frÃ¥n XLIFF-specifikationen:

source: The ``font`` attribute is parsed for font family, size and weight, the above example shows all of that, though only font family is required. Any whitespace in the font family is converted to underscore, so ``Source Sans Pro`` becomes ``Source_Sans_Pro``, please keep that in mind when naming the font group (see :ref:`fonts`).
sv: Attributet ``font`` analyseras fÃ¶r teckensnittsfamilj, storlek och vikt. OvanstÃ¥ende exempel visar allt detta, Ã¤ven om endast teckensnittsfamiljen Ã¤r obligatorisk. Alla blanktecken i teckensnittsfamiljen konverteras till understreck, sÃ¥ ``Source Sans Pro`` blir ``Source_Sans_Pro``. TÃ¤nk pÃ¥ detta nÃ¤r du namnger teckensnittsgruppen (se :ref:`fonts`).

source: `font attribute in XLIFF 1.2 <https://docs.oasis-open.org/xliff/v1.2/os/xliff-core.html#font>`_
sv: `font-attributet i XLIFF 1.2 <https://docs.oasis-open.org/xliff/v1.2/os/xliff-core.html#font>`_

source: `maxwidth attribute in XLIFF 1.2 <https://docs.oasis-open.org/xliff/v1.2/os/xliff-core.html#maxwidth>`_
sv: `maxwidth-attributet i XLIFF 1.2 <https://docs.oasis-open.org/xliff/v1.2/os/xliff-core.html#maxwidth>`_

source: String keys
sv: StrÃ¤ngnycklar

source: Weblate identifies the units in the XLIFF file by ``resname`` attribute in case it is present and falls back to ``id`` (together with ``file`` tag if present).
sv: Weblate identifierar enheterna i XLIFF-filen med hjÃ¤lp av attributet ``resname`` om det finns, och faller tillbaka pÃ¥ ``id`` (tillsammans med taggen ``file`` om den finns).

source: The ``resname`` attribute is supposed to be human friendly identifier of the unit making it more suitable for Weblate to display instead of ``id``. The ``resname`` has to be unique in the whole XLIFF file. This is required by Weblate and is not covered by the XLIFF standard - it does not put any uniqueness restrictions on this attribute.
sv: Attributet ``resname`` ska vara en anvÃ¤ndarvÃ¤nlig identifierare fÃ¶r enheten, vilket gÃ¶r det mer lÃ¤mpligt fÃ¶r Weblate att visa istÃ¤llet fÃ¶r ``id``. ``resname`` mÃ¥ste vara unikt i hela XLIFF-filen. Detta krÃ¤vs av Weblate och omfattas inte av XLIFF-standarden â den stÃ¤ller inga krav pÃ¥ att detta attribut ska vara unikt.

source: Example XLIFF file:
sv: Exempel pÃ¥ XLIFF-fil:

source: Typical Weblate :ref:`component` for bilingual XLIFF
sv: Typisk Weblate :ref:`component` fÃ¶r tvÃ¥sprÃ¥kig XLIFF

source: `XLIFF Translation File`
sv: `XLIFF-Ã¶versÃ¤ttningsfil`

source: Typical Weblate :ref:`component` for monolingual XLIFF
sv: Typisk Weblate :ref:`component` fÃ¶r ensprÃ¥kig XLIFF

source: :doc:`/formats/xliff` is a different format and is not compatible with XLIFF 2.0.
sv: :doc:`/formats/xliff` Ã¤r ett annat format och Ã¤r inte kompatibelt med XLIFF 2.0.

source: `XML Localization Interchange File Format (XLIFF) 2.0` is currently only supported as bilingual.
sv: XML Localization Interchange File Format (XLIFF) 2.0 stÃ¶ds fÃ¶r nÃ¤rvarande endast som tvÃ¥sprÃ¥kigt.

source: `XLIFF 2.0 translation file`
sv: `XLIFF 2.0-Ã¶versÃ¤ttningsfil`

source: `XLIFF 2.0 with placeables support`
sv: XLIFF 2.0 med stÃ¶d fÃ¶r placerbara element

source: `XML Localization Interchange File Format (XLIFF) 2.0`_ specification
sv: `XML Localization Interchange File Format (XLIFF) 2.0`_ specifikation

source: `XLIFF 2.0 Translation File`
sv: `XLIFF 2.0-Ã¶versÃ¤ttningsfil`

source: YAML files
sv: YAML-filer

source: The plain YAML files with string keys and values. Weblate also extract strings from lists or dictionaries.
sv: Vanliga YAML-filer med strÃ¤ngnycklar och vÃ¤rden. Weblate extraherar Ã¤ven strÃ¤ngar frÃ¥n listor eller ordbÃ¶cker.

source: Weblate currently supports several variants of YAML translations:
sv: Weblate stÃ¶der fÃ¶r nÃ¤rvarande flera varianter av YAML-Ã¶versÃ¤ttningar:

source: Example of a YAML file:
sv: Exempel pÃ¥ en YAML-fil:

source: `YAML file`
sv: `YAML-fil`

source: :ref:`file_format_params` with the pattern `yaml_*` can be used to configure the behavior of the YAML format.
sv: :ref:`file_format_params` med mÃ¶nstret `yaml_*` kan anvÃ¤ndas fÃ¶r att konfigurera beteendet fÃ¶r YAML-formatet.

source: User docs
sv: AnvÃ¤ndardokumentation

source: Application developer guide
sv: Guide fÃ¶r applikationsutvecklare

source: Administrator docs
sv: AdministratÃ¶rsdokument

source: Contributor docs
sv: Dokument fÃ¶r bidragsgivare

source: Secure Weblate
sv: SÃ¤ker Weblate

source: Change history
sv: Ãndringshistorik

source: Weblate Documentation
sv: Weblate-dokumentation

source: Weblate's documentation is available in various languages and versions. Expand the "Read the Docs" panel at the bottom of the sidebar to see the list.
sv: Weblates dokumentation finns tillgÃ¤nglig pÃ¥ olika sprÃ¥k och i olika versioner. Expandera panelen "LÃ¤s dokumentationen" lÃ¤ngst ned i sidfÃ¤ltet fÃ¶r att se listan.

source: This documentation is translated from the `original English one <https://docs.weblate.org/en/latest/>`_ by community members on `Hosted Weblate <https://hosted.weblate.org/projects/weblate/documentation/>`_.
sv: Denna dokumentation Ã¤r Ã¶versatt frÃ¥n den engelska originalet <https://docs.weblate.org/en/latest/>_ av communitymedlemmar pÃ¥ Hosted Weblate <https://hosted.weblate.org/projects/weblate/documentation/>_.

source: Depending on the translation effort's completion level, you may find paragraphs or whole pages which are still in English. You can help the community by providing new translations or reviewing existing ones on Weblate.
sv: Beroende pÃ¥ hur lÃ¥ngt Ã¶versÃ¤ttningsarbetet har kommit kan det hÃ¤nda att du hittar stycken eller hela sidor som fortfarande Ã¤r pÃ¥ engelska. Du kan hjÃ¤lpa gemenskapen genom att bidra med nya Ã¶versÃ¤ttningar eller granska befintliga Ã¶versÃ¤ttningar pÃ¥ Weblate.

source: Welcome to the official documentation of `Weblate <https://weblate.org>`_, the libre software web-based continuous localization system.
sv: VÃ¤lkommen till den officiella dokumentationen fÃ¶r `Weblate <https://weblate.org>`_, det fria webbaserade systemet fÃ¶r kontinuerlig lokalisering.

source: The table of contents in the sidebar should let you easily access the documentation for your topic of interest. You can also use the search function in the top-left corner.
sv: InnehÃ¥llsfÃ¶rteckningen i sidomenyn gÃ¶r det enkelt att hitta dokumentation om det Ã¤mne du Ã¤r intresserad av. Du kan ocksÃ¥ anvÃ¤nda sÃ¶kfunktionen i det Ã¶vre vÃ¤nstra hÃ¶rnet.

source: First time here?
sv: FÃ¶rsta gÃ¥ngen hÃ¤r?

source: Read the :doc:`user/basic` to get an overview of what Weblate does.
sv: LÃ¤s :doc:`user/basic` fÃ¶r att fÃ¥ en Ã¶versikt Ã¶ver vad Weblate gÃ¶r.

source: Joining a translation project
sv: Delta i ett Ã¶versÃ¤ttningsprojekt

source: If you would like to contribute to a project as a translator, read about :doc:`user/translating`.
sv: Om du vill bidra till ett projekt som Ã¶versÃ¤ttare, lÃ¤s om :doc:`user/translating`.

source: Starting a translation project
sv: Starta ett Ã¶versÃ¤ttningsprojekt

source: For starting your own project on our cloud service Hosted Weblate, refer to :doc:`admin/projects`. For self-hosting your own Weblate clone, read our :doc:`admin/install`.
sv: FÃ¶r att starta ditt eget projekt pÃ¥ vÃ¥r molntjÃ¤nst Hosted Weblate, se :doc:`admin/projects`. FÃ¶r att sjÃ¤lv hosta din egen Weblate-klon, lÃ¤s vÃ¥r :doc:`admin/install`.

source: Check our :doc:`faq`.
sv: Se vÃ¥r :doc:`faq`.

source: Learn more about :ref:`contributing`.
sv: LÃ¤s mer om :ref:`contributing`.

source: The Python API is shipped separately, you need to install the :ref:`wlc` (wlc) to have it.
sv: Python API levereras separat, du mÃ¥ste installera :ref:`wlc` (wlc) fÃ¶r att fÃ¥ tillgÃ¥ng till det.

source: Base class for all exceptions.
sv: Basklass fÃ¶r alla undantag.

source: User key
sv: AnvÃ¤ndarkod

source: API server URL, if not specified default is used.
sv: API-serverns URL, om ingen anges anvÃ¤nds standardvÃ¤rdet.

source: Configuration object, overrides any other parameters.
sv: Konfigurationsobjekt, Ã¥sidosÃ¤tter alla andra parametrar.

source: Access class to the API, define API key and optionally API URL.
sv: FÃ¥ tillgÃ¥ng till API:et, definiera API-nyckel och eventuellt API-URL.

source: Request path
sv: BegÃ¤r vÃ¤g

source: Performs a single API GET call.
sv: UtfÃ¶r ett enda API GET-anrop.

source: Configuration section to use
sv: Konfigurationsavsnitt att anvÃ¤nda

source: Configuration file parser following XDG specification.
sv: Konfigurationsfilsparser enligt XDG-specifikationen.

source: Path from which to load configuration.
sv: SÃ¶kvÃ¤g frÃ¥n vilken konfigurationen ska laddas.

source: Loads configuration from a file, if none is specified, it loads from the `wlc` configuration file (:file:`~/.config/wlc`) placed in your XDG configuration path (:file:`/etc/xdg/wlc`).
sv: Laddar konfigurationen frÃ¥n en fil. Om ingen fil anges laddas den frÃ¥n `wlc`-konfigurationsfilen (:file:`~/.config/wlc`) som finns i din XDG-konfigurationssÃ¶kvÃ¤g (:file:`/etc/xdg/wlc`).

source: Settings to override as list of tuples
sv: InstÃ¤llningar som ska Ã¥sidosÃ¤ttas som en lista med tupler

source: stdout file object for printing output, uses ``sys.stdout`` as default
sv: stdout-filobjekt fÃ¶r utskrift, anvÃ¤nder ``sys.stdout`` som standard

source: Command-line arguments to process, uses ``sys.args`` as default
sv: Kommandoradsargument att bearbeta, anvÃ¤nder ``sys.args`` som standard

source: Main entry point for command-line interface.
sv: Huvudsaklig ingÃ¥ngspunkt fÃ¶r kommandoradsgrÃ¤nssnittet.

source: Decorator to register :class:`Command` class in main parser used by :func:`main`.
sv: Dekorator fÃ¶r att registrera klassen :class:`Command` i huvudparsern som anvÃ¤nds av :func:`main`.

source: Main class for invoking commands.
sv: Huvudklass fÃ¶r att anropa kommandon.

source: Data residency
sv: Dataresidens

source: All **Weblate Cloud** and **Hosted Weblate** services are hosted entirely within the **European Union**. This ensures strong data protection, clear jurisdiction, and compliance with European privacy standards.
sv: Alla **Weblate Cloud**- och **Hosted Weblate**-tjÃ¤nster Ã¤r helt och hÃ¥llet vÃ¤rdbaserade inom **Europeiska unionen**. Detta garanterar ett starkt dataskydd, tydlig jurisdiktion och efterlevnad av europeiska integritetsstandarder.

source: Our infrastructure is provided by **Hetzner Online GmbH**, a German data center operator with a long-standing reputation for reliability and sustainability. Hetznerâs facilities are certified under **ISO 27001** (information security) and **ISO 9001** (quality management), and are pursuing **ISO 50001** (energy management) certification.
sv: VÃ¥r infrastruktur tillhandahÃ¥lls av **Hetzner Online GmbH**, en tysk datacenteroperatÃ¶r med ett lÃ¥ngvarigt rykte om tillfÃ¶rlitlighet och hÃ¥llbarhet. Hetzner-anlÃ¤ggningarna Ã¤r certifierade enligt **ISO 27001** (informationssÃ¤kerhet) och **ISO 9001** (kvalitetsledning) och strÃ¤var efter att bli certifierade enligt **ISO 50001** (energiledning).

source: Where data lives
sv: Var data finns

source: All customer data, including translations, user information, and backups, is stored and processed within the EU.
sv: All kunddata, inklusive Ã¶versÃ¤ttningar, anvÃ¤ndarinformation och sÃ¤kerhetskopior, lagras och behandlas inom EU.

source: Primary data centers are located in **Germany**.
sv: PrimÃ¤ra datacenter finns i **Tyskland**.

source: No operational data leaves the EU unless explicitly requested by the customer (for example, for external backups or region-specific deployments).
sv: Inga operativa data lÃ¤mnar EU om inte kunden uttryckligen begÃ¤r det (till exempel fÃ¶r externa sÃ¤kerhetskopior eller regionsspecifika distributioner).

source: Privacy and regulatory compliance
sv: Sekretess och efterlevnad av regler och fÃ¶reskrifter

source: Weblate Cloud and Hosted Weblate follow privacy-by-design principles and meet the requirements of **GDPR**.
sv: Weblate Cloud och Hosted Weblate fÃ¶ljer principerna om inbyggt integritetsskydd och uppfyller kraven i **GDPR**.

source: Sustainability
sv: HÃ¥llbarhet
